## Import Libraries

In [1]:
import pandas as pd

## Obtain the Raw Data

In [2]:
URL_TITANIC = 'https://raw.githubusercontent.com/dushyantkhosla/tiny-datasets/master/titanic.csv'

In [6]:
df_raw = pd.read_csv(URL_TITANIC)

## Take a backup

In [7]:
df_raw.to_csv("../data/00-raw/titanic_0.csv")

## Inspect the Dataset

- Number of rows, columns
- Column Names
- Data Types
- Missing Values etc.

In [24]:
df_raw.head()

,passenger class,survived,name,AGE,Siblings/Spouses Aboard,par&ch,ticket,fare,cabin Number,embarked
0,1,1,"Allen, Miss. Elisabeth Walton",29.0000,0,0,24160,211.3375,B5,S
1,1,1,"Allison, Master. Hudson Trevor",0.9167,1,2,113781,151.5500,C22 C26,S
2,1,0,"Allison, Miss. Helen Loraine",2.0000,1,2,113781,151.5500,C22 C26,S
3,1,0,"Allison, Mr. Hudson Joshua Creighton",30.0000,1,2,113781,151.5500,C22 C26,S
4,1,0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",25.0000,1,2,113781,151.5500,C22 C26,S

In [8]:
df_raw.shape

(1309, 10)

In [12]:
df_raw.columns.tolist()

['passenger class',
 'survived',
 'name',
 'AGE',
 'Siblings/Spouses Aboard',
 'par&ch',
 'ticket',
 'fare',
 'cabin Number',
 'embarked']

In [21]:
df_raw.duplicated().value_counts()

False    1309
dtype: int64

In [15]:
df_raw.isnull().mean().round(2)

passenger class            0.00
survived                   0.00
name                       0.00
AGE                        0.20
Siblings/Spouses Aboard    0.00
par&ch                     0.00
ticket                     0.00
fare                       0.00
cabin Number               0.77
embarked                   0.00
dtype: float64

In [19]:
df_raw.dtypes

passenger class              int64
survived                     int64
name                        object
AGE                        float64
Siblings/Spouses Aboard      int64
par&ch                       int64
ticket                      object
fare                       float64
cabin Number                object
embarked                    object
dtype: object

In [22]:
df_raw.describe()

,passenger class,survived,AGE,Siblings/Spouses Aboard,par&ch,fare
count,1309.000000,1309.000000,1046.000000,1309.000000,1309.000000,1308.000000
mean,2.294882,0.381971,29.881135,0.498854,0.385027,33.295479
std,0.837836,0.486055,14.413500,1.041658,0.865560,51.758668
min,1.000000,0.000000,0.166700,0.000000,0.000000,0.000000
25%,2.000000,0.000000,21.000000,0.000000,0.000000,7.895800
50%,3.000000,0.000000,28.000000,0.000000,0.000000,14.454200
75%,3.000000,1.000000,39.000000,1.000000,0.000000,31.275000
max,3.000000,1.000000,80.000000,8.000000,9.000000,512.329200

In [23]:
df_raw.describe(include=['O'])

                    name    ticket cabin Number embarked
count               1309      1309          295     1307
unique              1307       929          186        3
top     Kelly, Mr. James  CA. 2343  C23 C25 C27        S
freq                   2        11            6      914

## Takeaways

- Column names need to be standardized


- There are no **duplicates**


- There are no `date` columns


- There are some `categoricals`
    - all except _embarked_ have too many unique values
    - we might need to create **dummies**


- There are some `numerics`
    - there are no apparent outliers
    - there are some missings


- There is an `id` variable
    - these have no predictive power, consider dropping it